[{
  "_id": {
    "$oid": "668cf9a7008e9c1c03e652e1"
  },
  "username": "hansu0419",
  "time": "19 hr. ago",
  "title": "how do u cope in college",
  "tag": "Scholarship",
  "description": "For my first 3 terms in dlsu, i already cried 3x. And I don’t easily cry. The first one was when I was overwhelmed by final reqs at final exams a week before the finals during the first term. The second time was during midterms last term. I just had my 3rd cry today, one freaking month after the term started. I haven’t taken any long exams for this term yet, but I am already tired and feeling anxious. If I can’t handle 21 units (this term), how am I going to survive next term (w/ 24 units)? I know college is hard, but I want to know how do u manage to not get burnt out or take care of your mental health while maintaining ur academic life :(",
  "deleted": false
},
{
  "_id": {
    "$oid": "668cf9a7008e9c1c03e652e2"
  },
  "username": "Lonely_Banana",
  "time": "1 hr. ago",
  "title": "Is it possible to start an org?",
  "tag": "Discussion",
  "description": "Just wondering if it would be possible to start an org? I know that if yes, it would probably be very tedious but can anyone share what would should be my first steps if it really is possible to start an org.",
  "deleted": false
},
{
  "_id": {
    "$oid": "668cf9a7008e9c1c03e652e3"
  },
  "username": "Reasonable_worry101",
  "time": "23 hr. ago",
  "title": "Can you shift to Taft if your accepted in Benilde?",
  "tag": "General Question",
  "description": "Hi i just applied sa benilde pero sa Taft ko talaga gusto but can't because nawalan ako ng slot. Let me know if its possible or recon letter talaga ang pinakamagandang chance for me to go to taft. Thanks!",
  "deleted": false
},
{
  "_id": {
    "$oid": "668cf9a7008e9c1c03e652e4"
  },
  "username": "nabikomai",
  "time": "19 hr. ago",
  "title": "How to become updated for future recruitments of events?",
  "tag": "General Question",
  "description": "Just wondering if it would be possible to start an org? I know that if yes, it would probably be very tedious but can anyone share what would should be my first steps if it really is possible to start an org.",
  "deleted": false
},
{
  "_id": {
    "$oid": "668cf9a7008e9c1c03e652e5"
  },
  "username": "AppleDeli1741",
  "time": "11 hr. ago",
  "title": "Lf someone to dress up as a banana with me and stroll around campus while holding hands🍌",
  "tag": "Student Life",
  "description": "Once or twice per term I like to randomly dress as a banana and walk around campus.</br></br> But now I think id like to level up my game and introduce a second banana. Kaya im finding someone na malakas ang trip or into cosplaying to dress up as a banana with me and hold hands to stroll around campus. </br></br> Prefferably a girl sna, pra it looks funny and cute, no romantic intended, palakasan lang ng trip wahahaha (pero oks rin if your a guy :>) </br></br> We are going to act like a normal couple and pretend as if we are not dressed up as a banana then well just stroll around the campus </br></br> We’ll also eat bananas while wearing our costumes and just chill </br></br> This will be a three day event (Tues,Thurs,Fri) pra all colleges can experience the banana. Im planning to execute this plan after independent learning week pra more free time </br></br> PM if interested :)) </br></br> Were also wearing sunglasses btw pra cool😼 </br></br> (I cant provide the costumes na im out na hahahahaha)",
  "deleted": false
},
{
  "_id": {
    "$oid": "66a5afd5b7998339e1f146c6"
  },
  "username": "hansu0419",
  "time": "19 hr. ago",
  "title": "how do u cope with myself",
  "tag": "Scholarship",
  "description": "For my first 3 terms in dlsu, i already cried 3x. And I don’t easily cry. The first one was when I was overwhelmed by final reqs at final exams a week before the finals during the first term. The second time was during midterms last term. I just had my 3rd cry today, one freaking month after the term started. I haven’t taken any long exams for this term yet, but I am already tired and feeling anxious. If I can’t handle 21 units (this term), how am I going to survive next term (w/ 24 units)? I know college is hard, but I want to know how do u manage to not get burnt out or take care of your mental health while maintaining ur academic life :(",
  "deleted": false
}]